{
  "message": "OK",
  "data": {
    "jobs": [
      {
        "id": 35433,
        "degree": "Bachelor",
        "job_title": "Online Tutors Needed - Flexible Hours",
        "job_country": "Philippines",
        "job_category": "Education",
        "job_type": "Contract",
        "job_location": "Quezon City",
        "job_description": "Founded in 2003, LatinHire is responsible for the recruiting operations of several leading e-learning companies.We manage teams of subject matter experts for some of the most successful education companies in the world. Currently, we are looking for experts in a number of subjects to work as online tutors for college students.The tutoring is done in English through chat applications, therefore a high level of written English is necessary. The greatest advantages of working as an online tutor with LatinHire is the flexibility of the job!As independent contractors, LatinHire tutors can choose the number of hours they want to work, from 5 to over 40 hours per week, and they can work from any place as long as they have a computer with a reliable, high-speed Internet connection.Must be able to write in English both clearly and professionally.Bachelor's degree preferred.Knowledgeable in any of the subjects below.BusinessAccountingEconomicsFinanceComputer ScienceDatabase SystemsPythonMath and EngineeringCalculusDifferential EquationsDiscrete MathematicsFinite MathematicsLinear AlgebraMultivariable CalculusQuantitative MethodsStatisticsScienceBiologyChemistryPhysics",
        "job_description_html": "<p>Founded in 2003, LatinHire is responsible for the recruiting operations of several leading e-learning companies.</p><p>We manage teams of subject matter experts for some of the most successful education companies in the world. Currently, we are looking for experts in a number of subjects to work as online tutors for college students.</p><p>The tutoring is done in English through chat applications, therefore a high level of written English is necessary. The greatest advantages of working as an online tutor with LatinHire is the&nbsp;<strong>flexibility of the job!</strong></p><p>As independent contractors, LatinHire tutors can choose the number of hours they want to work, from 5 to over 40 hours per week, and they can work&nbsp;<strong>from any place</strong>&nbsp;as long as they have a computer with a reliable, high-speed Internet connection.</p><ul><li>Must be able to write in English both clearly and professionally.</li><li>Bachelor's degree preferred.</li><li>Knowledgeable in any of the subjects below.</li></ul><p><br></p><p>Business</p><p><br></p><ul><li>Accounting</li><li>Economics</li><li>Finance</li></ul><p><br></p><p>Computer Science</p><p><br></p><ul><li>Database Systems</li><li>Python</li></ul><p><br></p><p>Math and Engineering</p><p><br></p><ul><li>Calculus</li><li>Differential Equations</li><li>Discrete Mathematics</li><li>Finite Mathematics</li><li>Linear Algebra</li><li>Multivariable Calculus</li><li>Quantitative Methods</li><li>Statistics</li></ul><p><br></p><p>Science</p><p><br></p><ul><li>Biology</li><li>Chemistry</li><li>Physics</li></ul><p><br></p>",
        "job_skills": "English language",
        "salary_range_from": 30000,
        "salary_range_to": 60000,
        "company_id": 20431,
        "company_name": "LatinHire",
        "company_location": "Overseas",
        "company_address": "Las Condes",
        "company_country": "Chile",
        "xp_lvl": "1 - 3 years",
        "highlighted": 0,
        "is_featured": 1,
        "refreshed_at": "2020-04-06 07:01:34",
        "is_salary_hidden": false,
        "updated_at": "2020-04-06 18:04:45",
        "expired_at": "2020-06-21 12:23:12",
        "company_logo": "https://assets.bossjob.com/companies/20431/logo/VeiHYAY8x8p4QrphhNZ1J2YrE7gJqa3bNsgcygWI.png",
        "is_company_verify": false,
        "job_region": "NCR",
        "is_saved": false
      },
      {
        "id": 33903,
        "degree": "Bachelor",
        "job_title": "Admin Manager",
        "job_country": "Philippines",
        "job_category": "Top Management,Human Resources,Clerical/Administrative",
        "job_type": "Full-time",
        "job_location": "Quezon City",
        "job_description": "We are looking for an experienced Administration Manager to supervise daily support operations of our company and plan the most efficient administrative procedures. You will lead a team of professionals to complete a range of administrative duties in different departments.A great administration manager has excellent communication and organizational skills. The ideal candidate will be well-versed in departmental procedures and policies and will be able to actively discover new ways to do the job more efficiently.The goal is to ensure all support activities are carried on efficiently and effectively to allow the other operations to function properly.Planning and coordinating administrative procedures and systems and devising ways to streamline processesRecruiting and training personnel and allocate responsibilities and office spaceAssessing staff performance and provide coaching and guidance to ensure maximum efficiencyPlan and coordinate administrative procedures and systems and devise ways to streamline processesRecruit and train personnel and allocate responsibilities and office spaceAssess staff performance and provide coaching and guidance to ensure maximum efficiencyEnsure the smooth and adequate flow of information within the company to facilitate other business operationsManage schedules and deadlinesMonitor inventory of office supplies and the purchasing of new material with attention to budgetary constraintsMonitor costs and expenses to assist in budget preparationOversee facilities services, maintenance activities and tradespersons (e.g electricians)Organize and supervise other office activities (recycling, renovations, event planning etc.)Ensure operations adhere to policies and regulationsKeep abreast with all organizational changes and business developmentsProven experience as administration managerIn-depth understanding of office management procedures and departmental and legal policiesFamiliarity with financial and facilities management principlesProficient in MS OfficeAn analytical mind with problem-solving skillsExcellent organizational and multitasking abilitiesA team player with leadership skillsBSc/BA in Business Administration or relative field",
        "job_description_html": "<p>We are looking for an experienced&nbsp;Administration Manager&nbsp;to supervise daily support operations of our company and plan the most efficient administrative procedures. You will lead a team of professionals to complete a range of administrative duties in different departments.</p><p>A great administration manager has excellent communication and organizational skills. The ideal candidate will be well-versed in departmental procedures and policies and will be able to actively discover new ways to do the job more efficiently.</p><p>The goal is to ensure all support activities are carried on efficiently and effectively to allow the other operations to function properly.</p><ul><li>Planning and coordinating administrative procedures and systems and devising ways to streamline processes</li><li>Recruiting and training personnel and allocate responsibilities and office space</li><li>Assessing staff performance and provide coaching and guidance to ensure maximum efficiency</li><li>Plan and coordinate administrative procedures and systems and devise ways to streamline processes</li><li>Recruit and train personnel and allocate responsibilities and office space</li><li>Assess staff performance and provide coaching and guidance to ensure maximum efficiency</li><li>Ensure the smooth and adequate flow of information within the company to facilitate other business operations</li><li>Manage schedules and deadlines</li><li>Monitor inventory of office supplies and the purchasing of new material with attention to budgetary constraints</li><li>Monitor costs and expenses to assist in budget preparation</li><li>Oversee facilities services, maintenance activities and tradespersons (e.g electricians)</li><li>Organize and supervise other office activities (recycling, renovations, event planning etc.)</li><li>Ensure operations adhere to policies and regulations</li><li>Keep abreast with all organizational changes and business developments</li></ul><ul><li>Proven experience as administration manager</li><li>In-depth understanding of&nbsp;office management&nbsp;procedures and departmental and legal policies</li><li>Familiarity with financial and facilities management principles</li><li>Proficient in MS Office</li><li>An analytical mind with problem-solving&nbsp;skills</li><li>Excellent organizational and multitasking abilities</li><li>A team player with leadership skills</li><li>BSc/BA in Business Administration or relative field</li></ul>",
        "job_skills": "Time Management,Entrepreneurship,Competitive Analysis,Problem Solving Skills,Excellent Communication Skills,People Management,Leadership Development,Employee Relations,Creative Problem Solving,Administrative Assistant",
        "salary_range_from": 15000,
        "salary_range_to": 20000,
        "company_id": 19761,
        "company_name": "JAT Gasoline Station (Unioil Petroleum Philippines, Inc.)",
        "company_location": "Quezon City",
        "company_address": "1295, 1112 E Rodriguez Sr. Ave, 1112 Metro Manila",
        "company_country": "Philippines",
        "xp_lvl": "1 - 3 years",
        "highlighted": 0,
        "is_featured": 0,
        "refreshed_at": "2020-04-08 16:18:53",
        "is_salary_hidden": false,
        "updated_at": "2020-04-08 16:18:53",
        "expired_at": "2020-07-07 16:18:50",
        "company_logo": "https://assets.bossjob.com/companies/19761/logo/Y51K0vqmSsbrAauRpZsIGBgRrRkve7EU9jJlwUKD.png",
        "is_company_verify": false,
        "job_region": "NCR",
        "is_saved": false
      },
      {
        "id": 35554,
        "degree": "Diploma",
        "job_title": "Shopify Web Developer (Home-based)",
        "job_country": "Philippines",
        "job_category": "Arts/Creative Design,E-commerce,IT - Software Engineering",
        "job_type": "Full-time",
        "job_location": "Homebased",
        "job_description": "Firefly Digital is on the lookout for a web developer who will support our website development projects. The idea candidate must be well mastered in front-end and back-end languages and knowledgeable of server-side code and system operations. This role will be responsible for developing new programs and features, as well as maintaining code via Shopify store, we are looking for skills in HTML/CSS, JavaScript, JQuery, Java, XML. Experience developing for websites, mobile sites and applications is desirable with an emphasis on responsive design. Attention to detail and a commitment to web standards is a must. We are a digital marketing performance agency, and therefore our websites must perform to drive leads and sales for our clients. We are looking for a website developer with a flare for marketing in today's day and age.Responsibilities:Be our resident Shopify Plus expertConstruct design solutions with the e-commerce team with a focus on improving website usability by building out custom Shopify themes and/or modify pre-existing themesSkilled in JavaScript, HTML, CSS JQuery, Java, .NET, XML.Implementing third-party solutions & apps.Experience developing front-end web applications that perform well on all devices using modern languages and frameworks.Managing our site codebase & ensure that all code on the site is in use or removed.Ensuring consistently excellent performance on all major devices/browsers, including fast load times & bug-free core functionality.Work with e-commerce stakeholders to scope new requests, plan and implement those requests on a priority basisWorking closely with the team to ensure practicality & function of designs.Work with the Ecommerce team to implement SEO/CRO best practices on Shopify sites. Qualifications:Extensive knowledge of Shopify Plus platform, minimum 2-3 years Shopify experienceExperience working with a mobile-first approach.Fluency in common web development languages, including HTML5, CSS3 and JavaScript/jQuery frameworks (MongoDB, Express, React, and Node.js).Experience developing front-end web applications that perform well on all devices using modern languages & frameworks.Experience with Shopify liquid and scripts.Experience building Shopify apps, custom applications and third-party API.Experience with tools such as the Google Analytics, and Google Tag ManagerAn understanding of W3C web standards/semantics and accessibility guidelines preferredExperience in Web DesignExperience in SilverStripe is an advantage Benefits:100% Remote Work Work in Morning shift (New Zealand Time Zone) SALARY: 35,000 PHP to 50,000 PHP (Depends on Experience)Please submit your application here: https://bit.ly/FireflySH3dpBtiLTECHNICAL REQUIREMENTS:Minimum:At least 5MBPS (DL) 1MBPS (UL) Internet Speedi3 or equivalent processor with 8GB RAM",
        "job_description_html": "<p>Firefly Digital is on the lookout for a web developer who will support our website development projects. The idea candidate must be well mastered in front-end and back-end languages and knowledgeable of server-side code and system operations. This role will be responsible for developing new programs and features, as well as maintaining code via Shopify store, we are looking for skills in HTML/CSS, JavaScript, JQuery, Java, XML. Experience developing for websites, mobile sites and applications is desirable with an emphasis on responsive design. Attention to detail and a commitment to web standards is a must. We are a digital marketing performance agency, and therefore our websites must perform to drive leads and sales for our clients. We are looking for a website developer with a flare for marketing in today's day and age.</p><p><strong>Responsibilities:</strong></p><ul><li>Be our resident Shopify Plus expert</li><li>Construct design solutions with the e-commerce team with a focus on improving website usability by building out custom Shopify themes and/or modify pre-existing themes</li><li>Skilled in JavaScript, HTML, CSS JQuery, Java, .NET, XML.</li><li>Implementing third-party solutions &amp; apps.</li><li>Experience developing front-end web applications that perform well on all devices using modern languages and frameworks.</li><li>Managing our site codebase &amp; ensure that all code on the site is in use or removed.</li><li>Ensuring consistently excellent performance on all major devices/browsers, including fast load times &amp; bug-free core functionality.</li><li>Work with e-commerce stakeholders to scope new requests, plan and implement those requests on a priority basis</li><li>Working closely with the team to ensure practicality &amp; function of designs.</li><li>Work with the Ecommerce team to implement SEO/CRO best practices on Shopify sites.</li></ul><p>&nbsp;</p><p><strong>Qualifications:</strong></p><ul><li>Extensive knowledge of Shopify Plus platform, minimum 2-3 years Shopify experience</li><li>Experience working with a mobile-first approach.</li><li>Fluency in common web development languages, including HTML5, CSS3 and JavaScript/jQuery frameworks (MongoDB, Express, React, and Node.js).</li><li>Experience developing front-end web applications that perform well on all devices using modern languages &amp; frameworks.</li><li>Experience with Shopify liquid and scripts.</li><li>Experience building Shopify apps, custom applications and third-party API.</li><li>Experience with tools such as the Google Analytics, and Google Tag Manager</li><li>An understanding of W3C web standards/semantics and accessibility guidelines preferred</li><li>Experience in Web Design</li><li>Experience in SilverStripe is an advantage</li></ul><p>&nbsp;</p><p><strong>Benefits:</strong></p><ul><li>100% Remote Work&nbsp;</li><li>Work in Morning shift (New Zealand Time Zone)</li></ul><p>&nbsp;</p><p>SALARY: 35,000 PHP to 50,000 PHP (Depends on Experience)</p><p><br></p><p>Please submit your application here: https://bit.ly/FireflySH3dpBtiL</p><p>TECHNICAL REQUIREMENTS:</p><p><br></p><p>Minimum:</p><p>At least 5MBPS (DL) 1MBPS (UL) Internet Speed</p><p>i3 or equivalent processor with 8GB RAM</p>",
        "job_skills": "Web Development,HTML/CSS/PHP/MYSQL,Web Design,JSON / XML / HTML / Javascript / JQuery,Full Stack Development",
        "salary_range_from": 35000,
        "salary_range_to": 50000,
        "company_id": 20478,
        "company_name": "Firefly Digital",
        "company_location": "Overseas",
        "company_address": "BizDojo, Level 3, Partners Life House 33-45 Hurstmere Rd,  Takapuna, 0622, Auckland",
        "company_country": "New Zealand",
        "xp_lvl": "3 - 5 years",
        "highlighted": 0,
        "is_featured": 0,
        "refreshed_at": "2020-04-08 07:02:04",
        "is_salary_hidden": false,
        "updated_at": "2020-04-08 07:02:04",
        "expired_at": "2020-06-23 11:54:58",
        "company_logo": "https://assets.bossjob.com/companies/20478/logo/Rv3FkjpUVAPtRAQLQ0cWityR5ygn6vu3gpHxKLzv.png",
        "is_company_verify": false,
        "job_region": "Homebased",
        "is_saved": false
      },
      {
        "id": 35262,
        "degree": "Diploma",
        "job_title": "Treasury Supervisor",
        "job_country": "Philippines",
        "job_category": "Corporate Finance/Investment,General/Cost Accounting,Banking/Financial",
        "job_type": "Full-time",
        "job_location": "Pasig",
        "job_description": "The Treasury Supervisor is responsible for managing the organisation's treasury function, protecting the business against currency movements.Major Duties and Responsibilities:Maintains stewardship for financial assets and debt including overall leadership of the cash management, debt management and budget management functions of the organization and its affiliated entities.Supervises the maintenance of internal controls designed to safeguard corporate assets and the integrity of its fiscal systems.Ensures the maintenance of corporate liquidity and financial stability.Forecasting, develops and manages strategies, operations, policies and budgets relating to treasury activities.Responsible for planning, coordinating and directing all treasury functions across all gyms.Monitoring, controlling, releasing and replenishing of petty cash funds.Preparation of the Daily Sales Report for cash and charge sales and other modes of payments such as CSI, NMS, MCR..Prepares notice of shortage, summary of shortages for cash and credit card to be forwarded to HR department for salary deduction.Ascertains proper bank transaction of collections received on the previous day by ensuring that all cash / cheque collections are fully accounted for and checking transactions to depository accounts and monitors passbook balance of disbursing ATM and ERS account.Check, verify and reconcile bank deposits and bank payments.Timely completion of all bank reconciliations, adjustments and daily auditing of membership.Prepares other necessary reports such as Problematic Cards and Cash, Daily Collections and Membership daily sales report.Inspect, investigate and resolve discrepancies in cash transactions.Performs daily cash reconciliation of funds. Document all cash transaction activities.Maintain and manage all financial records, registers, logs and spreadsheetsSkills and Qualifications:- Must have a bachelor’s degree in Finance, Accounting, Statistics, Business Administration, or a related field- 5 to 10 years experience in Officer or Supervisory role.- Able to handle multiple entities and locations- Experience with start up organizations and/or franchise business model is an advantage- CPA is not required but high level of experience is a must- Must have keen attention to details, high level mathematics skills and computer skills- Must be analytical, organized and able to exhibit good time management​WORK LOCATION: Ortigas Center, Pasig City",
        "job_description_html": "<p>The Treasury Supervisor is responsible for managing the organisation's treasury function, protecting the business against currency movements.</p><p><br></p><p><strong>Major Duties and Responsibilities:</strong></p><ul><li>Maintains stewardship for financial assets and debt including overall leadership of the cash management, debt management and budget management functions of the organization and its affiliated entities.</li><li>Supervises the maintenance of internal controls designed to safeguard corporate assets and the integrity of its fiscal systems.</li><li>Ensures the maintenance of corporate liquidity and financial stability.</li><li>Forecasting, develops and manages strategies, operations, policies and budgets relating to treasury activities.</li><li>Responsible for planning, coordinating and directing all treasury functions across all gyms.</li><li>Monitoring, controlling, releasing and replenishing of petty cash funds.</li><li>Preparation of the Daily Sales Report for cash and charge sales and other modes of payments such as CSI, NMS, MCR..</li><li>Prepares notice of shortage, summary of shortages for cash and credit card to be forwarded to HR department for salary deduction.</li><li>Ascertains proper bank transaction of collections received on the previous day by ensuring that all cash / cheque collections are fully accounted for and checking transactions to depository accounts and monitors passbook balance of disbursing ATM and ERS account.</li><li>Check, verify and reconcile bank deposits and bank payments.</li><li>Timely completion of all bank reconciliations, adjustments and daily auditing of membership.</li><li>Prepares other necessary reports such as Problematic Cards and Cash, Daily Collections and Membership daily sales report.</li><li>Inspect, investigate and resolve discrepancies in cash transactions.</li><li>Performs daily cash reconciliation of funds. Document all cash transaction activities.</li><li>Maintain and manage all financial records, registers, logs and spreadsheets</li></ul><p><br></p><p><strong>Skills and Qualifications:</strong></p><ol><li>- Must have a bachelor’s degree in Finance, Accounting, Statistics, Business Administration, or a related field</li><li>- 5 to 10 years experience in Officer or Supervisory role.</li><li>- Able to handle multiple entities and locations</li><li>- Experience with start up organizations and/or franchise business model is an advantage</li><li>- CPA is not required but high level of experience is a must</li><li>- Must have keen attention to details, high level mathematics skills and computer skills</li><li>- Must be analytical, organized and able to exhibit good time management</li></ol><p><br></p><p><strong>​WORK LOCATION: </strong><em>Ortigas Center, Pasig City</em></p>",
        "job_skills": "Communications,Analytical skills,Asset Management,Analytics & Reporting,Computer Vision,Business Development,Forecasting,Wealth Management",
        "salary_range_from": 35000,
        "salary_range_to": 40000,
        "company_id": 20358,
        "company_name": "Anytime Fitness",
        "company_location": "Pasig",
        "company_address": "One San Miguel Avenue Condominium, corner Shaw Blvd., Ortigas Center 1600",
        "company_country": "Philippines",
        "xp_lvl": "1 - 3 years",
        "highlighted": 0,
        "is_featured": 0,
        "refreshed_at": "2020-04-08 07:02:00",
        "is_salary_hidden": false,
        "updated_at": "2020-04-08 07:02:00",
        "expired_at": "2020-06-09 12:18:26",
        "company_logo": "https://assets.bossjob.com/companies/20358/logo/gYY6rPfC3tgxtobHbm1MSZxkfNhVydOoDYEEoW12.png",
        "is_company_verify": false,
        "job_region": "NCR",
        "is_saved": false
      },
      {
        "id": 35252,
        "degree": "Diploma",
        "job_title": "Production Assistant (Home-based)",
        "job_country": "Philippines",
        "job_category": "Project Management,General Work",
        "job_type": "Full-time",
        "job_location": "Homebased",
        "job_description": "Part Time - Full Time Growth Oriented Production Assistant Wanted\t If you want …to love where you work and look forward to what the day might bringa place where you can actively grow personally and professionallyto have a positive impact on the growth of the company where you workto work with talented, passionate people in a positive supportive atmosphere                      ...then you have found your dream job. You should be working with Us!-------------------------------------------------------------------------------------------------------------------------Who are We?We are a family run real estate appraisal company based in Boston Massachusetts, proudly giving a portion of our profits directly to https://www.familyaccess.org/  supporting early childhood health and education services.We are looking to train and add one new very special member to our production team.  The winning applicant is a person who embraces the growth mindset https://www.youtube.com/watch?v=hiiEeMN7vbQSome people have a fixed mindset and believe that basic abilities, intelligence, and talents are fixed traits.  Our team has a growth mindset.  We believe that our abilities and intelligence can be developed with effort, learning, and persistence. In this environment, mistakes are just feedback tools for us to learn from.This is an invitation to come grow together with us!What do we do?Appraisers figure out what peoples’ homes are worth for various reasons. We believe that our customers deserve accuracy and have systems in place to make sure that we do. You will be part of a team helping clients who are attorneys, accountants, families or individuals that are; Divorcees in need of accurate valuations to help settle their finances,Family members who lost a parent and are settling an estate or inherited a home,Home owners trying to reduce their property taxes,Real estate agents, buyers & sellers needing appraisals before selling a home,Banks and other lenders helping people purchase or refinance a home. What are the work hours?The immediate opening is Part- time 20+ hours as we blend you into our company. This will change to full time ASAP, depending on your abilities and desires The first 2-4 weeks of initial training takes place during East Coast time business hours. Initial training is scheduled within the hours of 9:00am-6:00pm EST.  Your work hours are then flexible once you are trained. The sooner you learn, the sooner you can switch to local time schedule except for other training and meetings.Daily task accomplishment reports must be provided daily and invoices provided twice per month.What will you be doing?You will be responsible for production support and also for marketing supportProduction support responsibilities include:Your initial job will be to focus on gathering online documents connected to Massachusetts properties (legal ownership documents, pictures of homes, floorplans Aerial maps, etc.)Next will be to learn how to add documents into an appraisal report.Marketing support responsibilities include Add names to growing client list databaseWorking on business growth via social mediaEdit web page, FB page Linkedin etc.It is a huge plus if you have experience with video editing skills for editing various training and marketing videos for different uses.  Also if you have creative artistic skills, for creating holiday greeting cards, memes and materials for use in Facebook, Linked In, YouTube etc. Specific training will be provided by our team and we will pay for Udemy or other training courses as needed.Who we are looking for!A person who is:focused, organized and detail oriented (an absolute must)has a positive attitude and a good work ethicpossess strong Windows skillshave excellent manners and people skills can partner well with others on projectsHighly responsible High commitment The following experiences are a huge plus but not necessary as training can be provided. The right attitude and ability will be highly valued.any real estate experienceMicrosoft office skills (Power Point, Excel, Word)prior supporting experience in sales and marketing You must have Fast Laptop or PC preferably less than 2-3 years old Windows 10 Reliable High speed internet minimum speed 10 MbpsBackup internet planHow much is the pay? Competitive pricing corresponding with your initial experience and skills This is an opportunity in a growing company to increase your value and therefore your income. We honestly want you to become so valuable that you continue to earn yearlyAfter a 30 day probationary period there is a pay increase 13th week and major holidays will also be paid 5 paid personal days after 6 months, then 10 per year going forward.Healthcare reimbursal provided after 6 months proof of insurance requiredHow to applyPlease provide as much of the following information possible to jobs@aladdinappraisal.comYour Skype name for interviews How soon can you start?Will you have another (2nd) job?Are you currently or planning on going to school?What is your desired hourly rate? The exact make, model, speed. RAM, & hard drive capacity of your computerYour software list (briefly describe what you own or have used before, and your level of expertise).What is your current internet speed (attach a recent, dated screenshot).Please provide links to your website, Facebook, instagram, YouTube, etc.Rate yourself for the following skills, on a scale of 1-10 English speaking English writing Typing (estimated WPM)Windows 10 skillsResume with past experience/skills.Contact info for references. We only interview candidates with reachable references.Any other information you want us to have to consider advancing you to the interview step.Remember this is a job only for a hardworking, passionate person with EXCELLENT communication skills. This means that you must speak English fluently and that you will be diligent about sending in daily work reports as well as letting us know if you don’t understand something or have difficulty with an assignment so we can help you work through it (Growth Mindset). The only mistake you can make on our team is not admitting when there is a problem. When applying for this position please type *Growth mindset* into the subject line of your response to confirm that you’ve read this entire job post.  What happens after submitting the information?We will select the best candidates then for the next step in our process which is a short fun little video of you describing a favorite Show or movie, and what you like about.We have a simple three step processStep 1; Email the requested info aboveStep 2: We let you know if you are selected to then submit the video Step 3 Interview 9one or two rounds max)Thank You and Best of Luck!Adam Wiener",
        "job_description_html": "<p><strong>Part Time - Full Time Growth Oriented Production Assistant Wanted</strong></p><p>\t<strong>&nbsp;</strong></p><p><strong>If you want …</strong></p><ul><li><strong>to love where you work </strong>and look forward to what the day might bring</li><li>a place where you can actively <strong>grow personally and professionally</strong></li><li>to <strong>have a positive impact </strong>on the growth of the company where you work</li><li>to work with talented, passionate people in <strong>a positive supportive atmosphere</strong></li></ul><p><br></p><p><strong>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;...then you have found your dream job. You should be working with Us!</strong></p><p><br></p><p>-------------------------------------------------------------------------------------------------------------------------</p><p><strong>Who are We?</strong></p><p>We are a family run real estate appraisal company based in Boston Massachusetts, proudly giving a portion of our profits directly to https://www.familyaccess.org/&nbsp; supporting early childhood health and education services.</p><p><br></p><p>We are looking to train and add one new very special member to our production team.&nbsp; The winning applicant is a person who embraces the growth mindset https://www.youtube.com/watch?v=hiiEeMN7vbQ</p><p><br></p><p>Some people have a fixed mindset and believe that basic abilities, intelligence, and talents are&nbsp;fixed&nbsp;traits.&nbsp; Our team has a&nbsp;growth mindset.  We believe that our abilities and intelligence can be developed with effort, learning, and persistence. In this environment, mistakes are just feedback tools for us to learn from.</p><p><br></p><p>This is an invitation to come grow together with us!</p><p><br></p><p><strong>What do we do?</strong></p><p>Appraisers figure out what peoples’ homes are worth for various reasons. We believe that our customers deserve accuracy and have systems in place to make sure that we do. You will be part of a team helping clients who are attorneys, accountants, families or individuals that are;&nbsp;</p><ul><li>Divorcees in need of accurate valuations to help settle their finances,</li><li>Family members who lost a parent and are settling an estate or inherited a home,</li><li>Home owners trying to reduce their property taxes,</li><li>Real estate agents, buyers &amp; sellers needing appraisals before selling a home,</li><li>Banks and other lenders helping people purchase or refinance a home.&nbsp;</li></ul><p><br></p><p><strong>What are the work hours?</strong></p><p>The immediate opening is <strong>Part- time</strong> 20+ hours as we blend you into our company.&nbsp;</p><p>This will change to full time ASAP, depending on your abilities and desires&nbsp;</p><p>The first 2-4 weeks of initial training takes place during East Coast time business hours.&nbsp;</p><p>Initial training is scheduled within the hours of 9:00am-6:00pm EST.&nbsp;&nbsp;</p><p>Your work hours are then flexible once you are trained. The sooner you learn, the sooner you can switch to local time schedule except for other training and meetings.</p><p>Daily task accomplishment reports must be provided daily and invoices provided twice per month.</p><p><br></p><p><strong>What will you be doing?</strong></p><p>You will be responsible for production support and also for marketing support</p><p>Production support responsibilities include:</p><p>Your initial job will be to focus on gathering online documents connected to Massachusetts properties (legal ownership documents, pictures of homes, floorplans Aerial maps, etc.)</p><p>Next will be to learn how to add documents into an appraisal report.</p><p><br></p><p>Marketing support responsibilities include&nbsp;</p><ul><li>Add names to growing client list database</li><li>Working on business growth via social media</li><li>Edit web page, FB page Linkedin etc.</li></ul><p>It is a huge plus if you have experience with video editing skills for editing various training and marketing videos for different uses.&nbsp; Also if you have creative artistic skills, for creating holiday greeting cards, memes and materials for use in Facebook, Linked In, YouTube etc.&nbsp;</p><p><br></p><p>Specific training will be provided by our team and we will pay for Udemy or other training courses as needed.</p><p><strong>Who we are looking for!</strong></p><p>A person who is:</p><ul><li>focused, organized and detail oriented (an absolute must)</li><li>has a positive attitude and a good work ethic</li><li>possess strong Windows skills</li><li>have excellent manners and people skills&nbsp;</li><li>can partner well with others on projects</li><li>Highly responsible&nbsp;</li><li>High commitment&nbsp;</li></ul><p><br></p><p>The following experiences are a huge plus but not necessary as training can be provided.&nbsp;The right attitude and ability will be highly valued.</p><ul><li>any real estate experience</li><li>Microsoft office skills (Power Point, Excel, Word)</li><li>prior supporting experience in sales and marketing&nbsp;</li></ul><p><br></p><p><strong>You must have&nbsp;</strong></p><ul><li>Fast Laptop or PC preferably less than 2-3 years old&nbsp;</li><li>Windows 10&nbsp;</li><li>Reliable High speed internet minimum speed 10 Mbps</li><li>Backup internet plan</li></ul><p><br></p><p><strong>How much is the pay?&nbsp;</strong></p><p>Competitive pricing corresponding&nbsp;with your initial experience and skills&nbsp;</p><p>This is an opportunity in a growing company to increase your value and therefore your income.&nbsp;</p><p>We honestly want you to become so valuable that you continue to earn yearly</p><p>After a 30 day probationary period there is a pay increase&nbsp;</p><p>13th week and major holidays will also be paid&nbsp;</p><p>5 paid personal days after 6 months, then 10 per year going forward.</p><p>Healthcare reimbursal provided after 6 months proof of insurance required</p><p><br></p><p><strong>How to apply</strong></p><p>Please provide as much of the following information possible to jobs@aladdinappraisal.com</p><ol><li>Your Skype name for interviews&nbsp;</li><li>How soon can you start?</li><li>Will you have another (2nd) job?</li><li>Are you currently or planning on going to school?</li><li>What is your desired hourly rate?&nbsp;</li><li>The exact make, model, speed. RAM, &amp; hard drive capacity of your computer</li><li>Your software list (briefly describe what you own or have used before, and your level of expertise).</li><li>What is your current internet speed (attach a recent, dated screenshot).</li><li>Please provide links to your website, Facebook, instagram, YouTube, etc.</li><li>Rate yourself for the following skills, on a scale of 1-10&nbsp;</li><li>English speaking&nbsp;</li><li>English writing&nbsp;</li><li>Typing (estimated WPM)</li><li>Windows 10 skills</li><li>Resume with past experience/skills.</li><li>Contact info for references. We only interview candidates with reachable references.</li><li>Any other information you want us to have to consider advancing you to the interview step.</li></ol><p><br></p><p>Remember this is a job only for a hardworking, passionate person with EXCELLENT communication skills. This means that you must speak English fluently and that you will be diligent about sending in daily work reports as well as letting us know if you don’t understand something or have difficulty with an assignment so we can help you work through it (Growth Mindset).&nbsp;The only mistake you can make on our team is not admitting when there is a problem. When applying for this position please type *Growth mindset* into the subject line of your response to confirm that you’ve read this entire job post.&nbsp;&nbsp;</p><p><br></p><p><strong>What happens after submitting the information?</strong></p><p>We will select the best candidates then for the next step in our process which is a short fun little video of you describing a favorite Show or movie, and what you like about.</p><p><br></p><p>We have a simple three step process</p><p>Step 1; Email the requested info above</p><p>Step 2: We let you know if you are selected to then submit the video&nbsp;</p><p>Step 3 Interview&nbsp;9one or two rounds max)</p><p><br></p><p><br></p><p>Thank You and Best of Luck!</p><p><br></p><p>Adam Wiener</p>",
        "job_skills": "Windows 10,Microsoft Office,Marketing Research,Sales and Marketing,SEO,Social media,Documentation ",
        "salary_range_from": 25000,
        "salary_range_to": 35000,
        "company_id": 20364,
        "company_name": "Aladdin Appraisa",
        "company_location": "Overseas",
        "company_address": "187 Auburndale Ave Auburndale, MA 02466 USA",
        "company_country": "Afghanistan",
        "xp_lvl": "3 - 5 years",
        "highlighted": 0,
        "is_featured": 0,
        "refreshed_at": "2020-04-08 07:01:59",
        "is_salary_hidden": false,
        "updated_at": "2020-04-08 07:01:59",
        "expired_at": "2020-06-09 10:40:47",
        "company_logo": "https://assets.bossjob.com/companies/20364/logo/MwCuCHUBysx1K9FnxTE1XvUV9RLB16zu5I2GbS2C.png",
        "is_company_verify": false,
        "job_region": "Homebased",
        "is_saved": false
      },
      {
        "id": 35214,
        "degree": "Diploma",
        "job_title": "Finance And Accounting Manager",
        "job_country": "Philippines",
        "job_category": "General/Cost Accounting,Banking/Financial,General Manager",
        "job_type": "Full-time",
        "job_location": "Bacolod",
        "job_description": "Duties and Responsibilities:• Structure and lead the whole finance team and oversee the daily operation of the department.• Research and analyzes accounting principles.• Ensure compliance with the accepted accounting principles and company processes as stated in the SOP of the department.• Make sure that TAX returns are submitted in a timely manner and in general ensure compliance with tax laws and regulations of the Bureau of Internal Revenue.• Leads the financial reporting for regulators and company operational tasks.• Costing and planning.• Review, structures, and correct errors and inconsistencies in financial reports, documents, etc.• Computation and payment of staff salaries on a monthly basis.• Works with internal and external auditors during financial and operational audits.• Develop, maintain, implement and upgrade financial systems and procedures.• Other tasks to be performed as mandated by the management.Qualifications:• Graduate of Bachelor’s Degree in Accountancy and is a Certified Public Accountant (CPA)• At least three (3) years working experience in the field• Good interpersonal skill• Able to handle and lead the finance department",
        "job_description_html": "<p><strong>Duties and Responsibilities:</strong></p><p>•&nbsp;<em>Structure and lead the whole finance team and oversee the daily operation of the department.</em></p><p><em>• Research and analyzes accounting principles.</em></p><p><em>• Ensure compliance with the accepted accounting principles and company processes as stated in the SOP of the department.</em></p><p><em>• Make sure that TAX returns are submitted in a timely manner and in general ensure compliance with tax laws and regulations of the Bureau of Internal Revenue.</em></p><p><em>• Leads the financial reporting for regulators and company operational tasks.</em></p><p><em>• Costing and planning.</em></p><p><em>• Review, structures, and correct errors and inconsistencies in financial reports, documents, etc.</em></p><p><em>• Computation and payment of staff salaries on a monthly basis.</em></p><p><em>• Works with internal and external auditors during financial and operational audits.</em></p><p><em>• Develop, maintain, implement and upgrade financial systems and procedures.</em></p><p><em>• Other tasks to be performed as mandated by the management.</em></p><p><strong>Qualifications:</strong></p><p>•&nbsp;<em>Graduate of Bachelor’s Degree in Accountancy and is a Certified Public Accountant (CPA)</em></p><p><em>• At least three (3) years working experience in the field</em></p><p><em>• Good interpersonal skill</em></p><p><em>• Able to handle and lead the finance department</em></p>",
        "job_skills": "",
        "salary_range_from": 10000,
        "salary_range_to": 15000,
        "company_id": 20351,
        "company_name": "Del Rio Realty & Development of Bacolod, Inc.",
        "company_location": "Bacolod",
        "company_address": "Unit 206, Pacita Arcade Building, La Salle Avenue 6100",
        "company_country": "Philippines",
        "xp_lvl": "1 - 3 years",
        "highlighted": 0,
        "is_featured": 0,
        "refreshed_at": "2020-04-08 07:01:56",
        "is_salary_hidden": false,
        "updated_at": "2020-04-08 07:01:56",
        "expired_at": "2020-06-09 10:35:42",
        "company_logo": "https://assets.bossjob.com/companies/20351/logo/0lFO2nYGS3GBArQoANgy77sBqMYqItmJoli18o2k.jpeg",
        "is_company_verify": false,
        "job_region": "Negros Island",
        "is_saved": false
      },
      {
        "id": 34696,
        "degree": "Diploma",
        "job_title": "Java Developers",
        "job_country": "Philippines",
        "job_category": "IT - Software Engineering",
        "job_type": "Full-time",
        "job_location": "Pasay",
        "job_description": "1. Requirements review;2. Functional design, implementation, and testing;3. Function upgrade and maintenance;4. Write system documentation;Others:Designing & developing multichannel web applications (in-vehicle, web, app, …);Integrating applications with enterprise & content backends;Practicing test-driven development;Automate building, deployments & infrastructure;Leveraging leading-edge technologies;1. Bachelor degree or above, Internet company background, more than 3 years work experience, and experience in large website design and development or high-traffic business development2. Proficient in the Java language, familiar with common open source frameworks such as SSH, and have an in-depth understanding and practical experience of JVM, multithreading, network IO, and locking mechanisms;3. Familiar with MySQL database and its principles, proficient in using SQL statements and optimization, and have a deep understanding of database transactions, locks and indexes4. Familiar with distributed service architecture and distributed cache, which can realize high concurrency and high availability system.5, familiar with Spring, Spring Boot, MyBatis, Redis, Kafka, MQ, Zookeeper, Dubbo, and other open source projects;6. Experience in microservice development is preferred;7, 3 years or more of JAVA project development experience; prior experience in large-scale projects is preferred;8,It's better fluent in Mandarin",
        "job_description_html": "<p>1. Requirements review;</p><p>2. Functional design, implementation, and testing;</p><p>3. Function upgrade and maintenance;</p><p>4. Write system documentation;</p><p>Others:</p><p><br></p><p>Designing &amp; developing multichannel web applications (in-vehicle, web, app, …);</p><p>Integrating applications with enterprise &amp; content backends;</p><p>Practicing test-driven development;</p><p>Automate building, deployments &amp; infrastructure;</p><p>Leveraging leading-edge technologies;</p><p>1. Bachelor degree or above, Internet company background, more than 3 years work experience, and experience in large website design and development or high-traffic business development</p><p>2. Proficient in the Java language, familiar with common open source frameworks such as SSH, and have an in-depth understanding and practical experience of JVM, multithreading, network IO, and locking mechanisms;</p><p>3. Familiar with MySQL database and its principles, proficient in using SQL statements and optimization, and have a deep understanding of database transactions, locks and indexes</p><p>4. Familiar with distributed service architecture and distributed cache, which can realize high concurrency and high availability system.</p><p>5, familiar with Spring, Spring Boot, MyBatis, Redis, Kafka, MQ, Zookeeper, Dubbo, and other open source projects;</p><p>6. Experience in microservice development is preferred;</p><p>7, 3 years or more of JAVA project development experience; prior experience in large-scale projects is preferred;</p><p>8,It's better fluent in Mandarin</p>",
        "job_skills": "mysql,java project development,Software Engineering",
        "salary_range_from": 150000,
        "salary_range_to": 300000,
        "company_id": 20065,
        "company_name": "weSource Management Consultancy Firm",
        "company_location": "Quezon City",
        "company_address": null,
        "company_country": "Philippines",
        "xp_lvl": "3 - 5 years",
        "highlighted": 0,
        "is_featured": 0,
        "refreshed_at": "2020-04-08 07:01:55",
        "is_salary_hidden": false,
        "updated_at": "2020-04-08 07:01:55",
        "expired_at": "2020-05-26 19:03:32",
        "company_logo": "https://assets.bossjob.com/companies/20065/logo/M5MhWp385SO0mY2GjnOhSUi4Cd6oUgYNc58P6uHW.jpeg",
        "is_company_verify": false,
        "job_region": "NCR",
        "is_saved": false
      },
      {
        "id": 34146,
        "degree": "Diploma",
        "job_title": "Accounting Staff",
        "job_country": "Philippines",
        "job_category": "General/Cost Accounting,Banking/Financial,Corporate Finance/Investment",
        "job_type": "Full-time",
        "job_location": "Quezon City",
        "job_description": "·        Conduct processing of documents prior to check preparation for accounts payables account.·        Responsible / accountable for the timely and accurate encoding and posting of accounting related transactions and entries into the company’s computerized accounting system.·        Prepares necessary statutory report to be filed for required government agencies i.e. BIR, SSS, HDMF, & Philhealth and submit these reports as instructed.·        Maintains all related physical files, record, forms and document in an efficient, organized and timely manner.·        Performs all other administrative duties, such as faxing, photocopying, printing of reports, distribution of documents and transmittal, courier duties, etc., are required and/or assigned.·        Achieve all key performance indicators in the performance of his/her duties.·        Resides in Valenzuela / Caloocan / Quezon City / Bulacan Area·        Willing to be assign in Novaliches Quezon City·        Preferably Accounting Degree Graduate·        At least 2 years of experience in industry, preferably in a manufacturing environment.·        Honest; of high integrity and good moral character·        Well-organized, meticulous with details and in the meeting stated deadlines·        Good oral and written communication skills.·        Good interpersonal skills; can work with people at different levels.·        Solid working experience with computers / computerized accounting system.·        Team player",
        "job_description_html": "<p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Conduct processing of documents prior to check preparation for accounts payables account.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Responsible / accountable for the timely and accurate encoding and posting of accounting related transactions and entries into the company’s computerized accounting system.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Prepares necessary statutory report to be filed for required government agencies i.e. BIR, SSS, HDMF, &amp; Philhealth and submit these reports as instructed.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Maintains all related physical files, record, forms and document in an efficient, organized and timely manner.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Performs all other administrative duties, such as faxing, photocopying, printing of reports, distribution of documents and transmittal, courier duties, etc., are required and/or assigned.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Achieve all key performance indicators in the performance of his/her duties.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Resides in Valenzuela / Caloocan / Quezon City / Bulacan Area</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Willing to be assign in Novaliches Quezon City</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Preferably Accounting Degree Graduate</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;At least 2 years of experience in industry, preferably in a manufacturing environment.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Honest; of high integrity and good moral character</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Well-organized, meticulous with details and in the meeting stated deadlines</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Good oral and written communication skills.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Good interpersonal skills; can work with people at different levels.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Solid working experience with computers / computerized accounting system.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Team player</p>",
        "job_skills": "Accounting,Billing,Accounts Payable,accounts receivable,General Ledger,Due Diligence,Financial Reporting",
        "salary_range_from": 15000,
        "salary_range_to": 20000,
        "company_id": 19795,
        "company_name": "Genknit Manufacturing Corporation",
        "company_location": "Quezon City",
        "company_address": "122 Susano Rd. Brgy. San Agustin Novaliches, Quezon City",
        "company_country": "Philippines",
        "xp_lvl": "1 - 3 years",
        "highlighted": 0,
        "is_featured": 0,
        "refreshed_at": "2020-04-08 07:01:52",
        "is_salary_hidden": false,
        "updated_at": "2020-04-08 07:01:52",
        "expired_at": "2020-05-12 17:11:23",
        "company_logo": "https://assets.bossjob.com/companies/19795/logo/Myc4rnTuZLcNy2oqDJl7DdAyiJ0lE77xLWsgEbgv.jpeg",
        "is_company_verify": false,
        "job_region": "NCR",
        "is_saved": false
      },
      {
        "id": 34141,
        "degree": "Bachelor",
        "job_title": "Principal Software Engineer (Full stack)",
        "job_country": "Philippines",
        "job_category": "IT - Software Engineering",
        "job_type": "Full-time",
        "job_location": "Makati",
        "job_description": "Role Overview:Working closely with the product management, design and engineering team, as a Principal Engineer, you are a subject matter and a primary domain expert responsible for the exquisite design and assembly of new technology, components, capabilities and products that grow finder’s capabilities. Your work can spearhead the growth of the commercial interests of the company. You will work closely with Engineering Leads, Principal Engineers, Product Managers and CPTO in order to achieve this. You excel at delivering an engineering-led, commercially focussed outcome from inception through to completion including deployment and successful operation in a production environment. You are an inspiration and mentor for those who seek to live and work across the technology stack - top to bottom, from the user interface through the messaging, service and data tiers as well as monitoring, working with and tuning the deployment in production if required. The expectations for success of this role are very high, and the influence of a principal engineer must to be felt across the global engineering teams. This responsibility will also come with great rewards, experience, coaching, mentoring and internal support to achieve success. As a Principal Engineer, you will work across all teams to champion and deliver a code quality that is high, and that each engineer is developing professionally. Your success will not be based solely on your output, but will include the performance of those around you. You are extremely collaborative, an accomplished mentor and coach, with a positive outlook and strong communication skills.In your role, it is essential that you have an understanding of the broader context of software engineering and product development strategy, including the intersection of technical, business and customer-facing factors that carve the way to your work being successful. You are an exemplar champion of our core values of 'empowering people' to take action, a 'go live' bias towards action, 'be straight up' approach to open communication and 'master your craft' which is all about continuous curiosity and learning.Main Responsibilities:The following is a list of the type of work you will perform:Subject matter and domain expertise on finder engineering principles and executionWorking with Engineering Leaders to drive strategic goals to improve technical direction.Guide projects and deliver on deadlines with a cross-functional teams.Embody, demonstrate and reinforce our company values.Quality and timely delivery of engineering deliverables. Identifying, improving and automating team processes and workflowsInterviewing and recruiting new team membersChampioning and embodying great software engineering principles to deliver a better experience for our users and an engaging technology-led engineering environment. Problem solving skills and the ability to create solutionsAbility to work either autonomously or with other members of the team to deliver outcomes.Coaching, mentoring and developing engineers and product managers. Essential Requirements of the Role:Demonstrable professional results from a cross-disciplinary delivery with Software Engineers, Product Managers and Designers based remotely in different timezones.10+ years experience in software engineering (or equivalent) Expertise in Agile development methodologies.Deep DevOps and networking experience, including monitoring, alerting and support. Demonstrable security, regulation, compliance and auditing expertise.Software and Systems Architecture and solution design.Thought and/or people leadership at a senior level. Continuous Integration and Continuous Deployment and Continuous Delivery practices. Ability to grow a team to work across the stack to deliver an outcome, including working with JavaScript, PHP, Java, React, MySQL and Akka/Docker. Great communicationExcellence in architectural design, including SOA, Microservice architectures, messaging and event processing. Nice to haves:Experience in Node.jsExperience with message queues, event processing and event sourcingEffective branching and merging techniques such as GitFlow and Trunk-Based DevelopmentApp design High performance, low latency computing Massive Use, Global Scale platformsFinancial Regulation in Australia, the USA and/or Europe. Security concepts and certification experience including SOC-2, PCI or ISO27001",
        "job_description_html": "<p><strong>Role Overview:</strong></p><p>Working closely with the product management, design and engineering team, as a Principal Engineer, you are a subject matter and a primary domain expert responsible for the exquisite design and assembly of new technology, components, capabilities and products that grow finder’s capabilities. Your work can spearhead the growth of the commercial interests of the company. You will work closely with Engineering Leads, Principal Engineers, Product Managers and CPTO in order to achieve this.&nbsp;</p><p><br></p><p>You excel at delivering an engineering-led, commercially focussed outcome from inception through to completion including deployment and successful operation in a production environment. You are an inspiration and mentor for those who seek to live and work across the technology stack - top to bottom, from the user interface through the messaging, service and data tiers as well as monitoring, working with and tuning the deployment in production if required.&nbsp;</p><p><br></p><p>The expectations for success of this role are very high, and the influence of a principal engineer must to be felt across the global engineering teams. This responsibility will also come with great rewards, experience, coaching, mentoring and internal support to achieve success.&nbsp;</p><p><br></p><p>As a Principal Engineer, you will work across all teams to champion and deliver a code quality that is high, and that each engineer is developing professionally. Your success will not be based solely on your output, but will include the performance of those around you. You are extremely collaborative, an accomplished mentor and coach, with a positive outlook and strong communication skills.</p><p><br></p><p>In your role, it is essential that you have an understanding of the broader context of software engineering and product development strategy, including the intersection of technical, business and customer-facing factors that carve the way to your work being successful. You are an exemplar champion of our core values of 'empowering people' to take action, a 'go live' bias towards action, 'be straight up' approach to open communication and 'master your craft' which is all about continuous curiosity and learning.</p><p><br></p><p><strong>Main Responsibilities:</strong></p><p>The following is a list of the type of work you will perform:</p><ul><li>Subject matter and domain expertise on finder engineering principles and execution</li><li>Working with Engineering Leaders to drive strategic goals to improve technical direction.</li><li>Guide projects and deliver on deadlines with a cross-functional teams.</li><li>Embody, demonstrate and reinforce our company values.</li><li>Quality and timely delivery of engineering deliverables.&nbsp;</li><li>Identifying, improving and automating team processes and workflows</li><li>Interviewing and recruiting new team members</li><li>Championing and embodying great software engineering principles to deliver a better experience for our users and an engaging technology-led engineering environment.&nbsp;</li><li>Problem solving skills and the ability to create solutions</li><li>Ability to work either autonomously or with other members of the team to deliver outcomes.</li><li>Coaching, mentoring and developing engineers and product managers.&nbsp;</li></ul><p><br></p><p><br></p><p><br></p><p><strong>Essential Requirements of the Role:</strong></p><ul><li>Demonstrable professional results from a cross-disciplinary delivery with Software Engineers, Product Managers and Designers based remotely in different timezones.</li><li>10+ years experience in software engineering (or equivalent)&nbsp;</li><li>Expertise in Agile development methodologies.</li><li>Deep DevOps and networking experience, including monitoring, alerting and support.&nbsp;</li><li>Demonstrable security, regulation, compliance and auditing expertise.</li><li>Software and Systems Architecture and solution design.</li><li>Thought and/or people leadership at a senior level.&nbsp;</li><li>Continuous Integration and Continuous Deployment and Continuous Delivery practices.&nbsp;</li><li>Ability to grow a team to work across the stack to deliver an outcome, including working with JavaScript, PHP, Java, React, MySQL and Akka/Docker.&nbsp;</li><li>Great communication</li><li>Excellence in architectural design, including SOA, Microservice architectures, messaging and event processing.&nbsp;</li></ul><p><br></p><p><strong><em>Nice to haves:</em></strong></p><ul><li><em>Experience in Node.js</em></li><li><em>Experience with message queues, event processing and event sourcing</em></li><li><em>Effective branching and merging techniques such as GitFlow and Trunk-Based Development</em></li><li><em>App design&nbsp;</em></li><li><em>High performance, low latency computing&nbsp;</em></li><li><em>Massive Use, Global Scale platforms</em></li><li><em>Financial Regulation in Australia, the USA and/or Europe.&nbsp;</em></li><li><em>Security concepts and certification experience including SOC-2, PCI or ISO27001</em></li></ul><p><br></p>",
        "job_skills": "Software Engineering,Web Development,PHP,JSON / XML / HTML / Javascript / JQuery,Node.js,AWS",
        "salary_range_from": 10000,
        "salary_range_to": 15000,
        "company_id": 19850,
        "company_name": "Oneto Scale Inc.",
        "company_location": "Makati",
        "company_address": null,
        "company_country": "Philippines",
        "xp_lvl": "> 10 years",
        "highlighted": 0,
        "is_featured": 0,
        "refreshed_at": "2020-04-08 07:01:51",
        "is_salary_hidden": false,
        "updated_at": "2020-04-08 07:01:51",
        "expired_at": "2020-05-12 17:09:27",
        "company_logo": "https://assets.bossjob.com/companies/19850/logo/EN75k217KFcjA0Trtn1p8Wly308s3swO3YmiNDf8.png",
        "is_company_verify": false,
        "job_region": "NCR",
        "is_saved": false
      },
      {
        "id": 34133,
        "degree": "Bachelor",
        "job_title": "Compliance Manager",
        "job_country": "Philippines",
        "job_category": "Top Management,Corporate Finance/Investment,Banking/Financial",
        "job_type": "Full-time",
        "job_location": "Makati",
        "job_description": "The Compliance Manager is responsible for the oversight and the management of all compliance-related functions within the company and within its affected partners, suppliers and applicable service providers, including the procedures described in the company’s Money Laundering Prevention Program.Develop Compliance rules and policies.Take lead in conducting Compliance Risk Assessments of new products, services, and processes. Perform conflict checks and sanction risk assessments for clients being on boarded by the company.Oversee the development, documentation, and dissemination of the company’s written supervisory procedures and compliance controls with applicable rules and regulations.Enforce adequate controls to provide early detection and prevention of potential compliance issues.Responsible for implementing policies and procedures to correct any identified compliance issues.Directly work with business management to develop, communicate and implement strategies, procedures and technology systems designed to enhance the company’s compliance with applicable rules and regulations.QualificationsUniversity qualification or above.Minimum 4 years of compliance experience within the financial service industry (banking, securities, insurance, etc.) preferred.Experienced in communicating directly with the BSP, AMLC, SEC, NPC and/or other relevant regulatory authorities.Familiar with financial services regulation, Anti-Money Laundering, and other applicable statutory and regulatory requirements.Fluent in English.",
        "job_description_html": "<p>The Compliance Manager is responsible for the oversight and the management of all compliance-related functions within the company and within its affected partners, suppliers and applicable service providers, including the procedures described in the company’s Money Laundering Prevention Program.</p><p><strong>Develop Compliance rules and policies.</strong></p><ul><li>Take lead in conducting Compliance Risk Assessments of new products, services, and processes. Perform conflict checks and sanction risk assessments for clients being on boarded by the company.</li><li>Oversee the development, documentation, and dissemination of the company’s written supervisory procedures and compliance controls with applicable rules and regulations.</li><li>Enforce adequate controls to provide early detection and prevention of potential compliance issues.</li><li>Responsible for implementing policies and procedures to correct any identified compliance issues.</li><li>Directly work with business management to develop, communicate and implement strategies, procedures and technology systems designed to enhance the company’s compliance with applicable rules and regulations.</li></ul><p><br></p><p><strong>Qualifications</strong></p><ul><li>University qualification or above.</li><li>Minimum 4 years of compliance experience within the financial service industry (banking, securities, insurance, etc.) preferred.</li><li>Experienced in communicating directly with the BSP, AMLC, SEC, NPC and/or other relevant regulatory authorities.</li><li>Familiar with financial services regulation, Anti-Money Laundering, and other applicable statutory and regulatory requirements.</li><li>Fluent in English.</li></ul>",
        "job_skills": "",
        "salary_range_from": 80000,
        "salary_range_to": 100000,
        "company_id": 5083,
        "company_name": "SCI Ventures, Inc.",
        "company_location": "Makati",
        "company_address": "9th Floor Sterling Center, 131 Dela Rosa Corner Ormaza Streets, Legaspi Village, 1229 Metro Manila",
        "company_country": "Philippines",
        "xp_lvl": "3 - 5 years",
        "highlighted": 0,
        "is_featured": 0,
        "refreshed_at": "2020-04-08 07:01:50",
        "is_salary_hidden": false,
        "updated_at": "2020-04-08 07:01:50",
        "expired_at": "2020-05-12 17:01:38",
        "company_logo": "https://assets.bossjob.com/companies/5083/logo/xIzutO03L1pbYEo3eZbKY0fEquVIil56eKcqE0eO.png",
        "is_company_verify": false,
        "job_region": "NCR",
        "is_saved": false
      },
      {
        "id": 34106,
        "degree": "Diploma",
        "job_title": "Accountant",
        "job_country": "Philippines",
        "job_category": "IT - Software Engineering,General/Cost Accounting,Banking/Financial",
        "job_type": "Full-time",
        "job_location": "Makati",
        "job_description": "Accountant: Develops, implements and/or maintains one or more accounting systems: Journal entries, General Ledger, Accounts Receivables, Accounts Payable, Revenue Reconciliation, etc. Reviews and interprets financial reporting requirements, rules and regulations. Balances books and prepares profit and loss, cash flow, income and balance sheet statements. Monitors and develops monthly reports of revenues and expenditures for projects. Provides record of assets, liabilities and other financial transactions. May prepare federal, state and local reports and tax returns. May assist in the setup of processes and procedures that properly capture, track and report revenue, including deferred revenue, in accordance with the company revenue recognition policy. May generate revenue reports for internal and/or external use. May interpret reports and records for managers/stakeholders. May be involved in reviewing, tracking and maintaining billing information in the financial systems, ensuring accuracy and compliance with U.S. GAAP and other accounting regulationsScan and process received supplier invoices onto the AP ledgers within the Oracle systemMatching invoices received to Purchase Orders, and assisting the Procurement team with the enforcement of the Mavenir purchase order policyProduce payment files and submitting remittances to vendors after proper internal approval has been obtainedAssist in maintaining and reconciling the Accounts Payable LedgerCompletion of monthly key supplier statement reconciliationsEnsure that all debit balances are understood and cleared on a timely basisMatching of payments to outstanding invoices on the supplier AP accountsAssist employees and external suppliers with any queries or concerns regarding purchase invoices and paymentsProduce ad hoc reports and key metrics for review by managementEnsure all GL entries are supportable with back up and clear audit trail of adjustmentsEnsure all transactions are properly recorded in the books of the entities ensuring completeness of all transactionsPreparation of the financial accounts for all subsidiaries. This will include the processing of all journals and the preparation of monthly balance sheet reconciliations for all entities in the Group.Assist in the preparation of sections of the Annual Report and statutory accounts for statutory entitiesInteraction with the external auditors on both the Group and company audits to ensure they are provided with appropriate records and explanations to efficiently conduct their audit.Maintenance of the chart of accounts, the key accounting policies of the group, the key accounting controls, and performance of those controls and reconciliationsProvide support for payments processing as and when requiredProvide support for external audit and local statutory requirementsKnowledge in Philippine taxation , filings, and payments.Candidate must possess at least a Bachelor's/College Degree, Professional License (Passed Board/Bar/Professional License Exam preferred but not required), Finance/Accountancy/Banking or equivalent.Required skill(s): MS Excel, MS Office. Detail orientated with a high degree of accuracy.Ability to meet deadlines and be flexible in an evolving environment.Good with numbers, reconciliations and able to deal with a large volume of data Strong communication skills verbal and written and ability to work and interact with all levels of personnel.Excellent communication skills in English (both written and verbal).",
        "job_description_html": "<p>Accountant: Develops, implements and/or maintains one or more accounting systems: Journal entries, General Ledger, Accounts Receivables, Accounts Payable, Revenue Reconciliation, etc. Reviews and interprets financial reporting requirements, rules and regulations. Balances books and prepares profit and loss, cash flow, income and balance sheet statements. Monitors and develops monthly reports of revenues and expenditures for projects. Provides record of assets, liabilities and other financial transactions. May prepare federal, state and local reports and tax returns. May assist in the setup of processes and procedures that properly capture, track and report revenue, including deferred revenue, in accordance with the company revenue recognition policy. May generate revenue reports for internal and/or external use. May interpret reports and records for managers/stakeholders. May be involved in reviewing, tracking and maintaining billing information in the financial systems, ensuring accuracy and compliance with U.S. GAAP and other accounting regulations</p><p><br></p><ul><li>Scan and process received supplier invoices onto the AP ledgers within the Oracle system</li><li>Matching invoices received to Purchase Orders, and assisting the Procurement team with the enforcement of the Mavenir purchase order policy</li><li>Produce payment files and submitting remittances to vendors after proper internal approval has been obtained</li><li>Assist in maintaining and reconciling the Accounts Payable Ledger</li><li>Completion of monthly key supplier statement reconciliations</li><li>Ensure that all debit balances are understood and cleared on a timely basis</li><li>Matching of payments to outstanding invoices on the supplier AP accounts</li><li>Assist employees and external suppliers with any queries or concerns regarding purchase invoices and payments</li><li>Produce ad hoc reports and key metrics for review by management</li><li>Ensure all GL entries are supportable with back up and clear audit trail of adjustments</li><li>Ensure all transactions are properly recorded in the books of the entities ensuring completeness of all transactions</li><li>Preparation of the financial accounts for all subsidiaries. This will include the processing of all journals and the preparation of monthly balance sheet reconciliations for all entities in the Group.</li><li>Assist in the preparation of sections of the Annual Report and statutory accounts for statutory entities</li><li>Interaction with the external auditors on both the Group and company audits to ensure they are provided with appropriate records and explanations to efficiently conduct their audit.</li><li>Maintenance of the chart of accounts, the key accounting policies of the group, the key accounting controls, and performance of those controls and reconciliations</li><li>Provide support for payments processing as and when required</li><li>Provide support for external audit and local statutory requirements</li><li>Knowledge in Philippine taxation , filings, and payments.</li></ul><p><br></p><ul><li>Candidate must possess at least a Bachelor's/College Degree, Professional License (Passed Board/Bar/Professional License Exam preferred but not required), Finance/Accountancy/Banking or equivalent.</li><li>Required skill(s): MS Excel, MS Office.</li><li>&nbsp;Detail orientated with a high degree of accuracy.</li><li>Ability to meet deadlines and be flexible in an evolving environment.</li><li>Good with numbers, reconciliations and able to deal with a large volume of data</li><li>&nbsp;Strong communication skills verbal and written and ability to work and interact with all levels of personnel.</li><li>Excellent communication skills in English (both written and verbal).</li></ul><p><br></p>",
        "job_skills": "",
        "salary_range_from": 25000,
        "salary_range_to": 30000,
        "company_id": 19833,
        "company_name": "Mavenir",
        "company_location": "Overseas",
        "company_address": "1700 International Parkway, Richardson, Texas 75081",
        "company_country": "United States",
        "xp_lvl": "1 - 3 years",
        "highlighted": 0,
        "is_featured": 0,
        "refreshed_at": "2020-04-08 07:01:48",
        "is_salary_hidden": false,
        "updated_at": "2020-04-08 07:01:48",
        "expired_at": "2020-05-12 16:37:55",
        "company_logo": "https://assets.bossjob.com/companies/19833/logo/phxXdoeYtoMKljkVhovzqmm6YUFTPcw9OehU4E7s.jpeg",
        "is_company_verify": false,
        "job_region": "NCR",
        "is_saved": false
      },
      {
        "id": 34102,
        "degree": "Not required",
        "job_title": "ECommerce Virtual Assistant Needed ASAP (Home-based)",
        "job_country": "Philippines",
        "job_category": "E-commerce,Clerical/Administrative,Marketing/Business Dev",
        "job_type": "Full-time",
        "job_location": "Homebased",
        "job_description": "For interested applicants,apply by following this link: http://bit.ly/36QHKzyWe are a California-base E-commerce company selling various products online. We are seeking a brilliant, highly-organized, friendly, virtual assistant with high-volume eCommerce experience. You will oversee and maintain the product, campaign and landing page building process; providing QA and proactively note and report any site issues.Responsibilities:- Daily maintenance and management of landing pages and product CRM, proactively problem solving any site issues- Update and manage sales and promotions, site content and E-Commerce catalog- Track and log site issues, bugs and improvements in the ticketing system, and actively partner with development teams to implement- Partner with the team on global release prioritization and schedules, performing full QA and sign off on releases- Work cross-functionally with marketing, buying, planning, and merchandising teams- Assist in the creation of the roadmap for new site features and functionalities- Weekly reporting of site behavior, checkout funnel and KPI analysis with Google Analytics- Leverage analytics and customer insights to identify, recommend, and implement site optimizations- Stay up to date on industry trends and best practices to ensure a best in class site experienceOur ideal candidate will have or are:- 2-3 years in a similar eCommerce role- Basic knowledge of HTML- Experience with Javascript is a Huge Plus- Proficient in Excel, Word, and PowerPoint- Strong communication and collaboration skills- Knowledge of eCommerce platforms and best practices- Experience with Split Tests and Analyzing the Results is a Huge Plus- Strong analytical and organizational skills- Able to work independently within a cross-functional team environmentFor interested applicants, please apply by following this link: http://bit.ly/36QHKzyPlease note that we won't be entertaining those who send their application through applying for this job post. We will only entertain those who completed the form.",
        "job_description_html": "<p>For interested applicants,apply by following this link:&nbsp;http://bit.ly/36QHKzy</p><p><br></p><p>We are a California-base E-commerce company selling various products online. We are seeking a brilliant, highly-organized, friendly, virtual assistant with high-volume eCommerce experience. You will oversee and maintain the product, campaign and landing page building process; providing QA and proactively note and report any site issues.</p><p><br></p><p>Responsibilities:</p><p>- Daily maintenance and management of landing pages and product CRM, proactively problem solving any site issues</p><p>- Update and manage sales and promotions, site content and E-Commerce catalog</p><p>- Track and log site issues, bugs and improvements in the ticketing system, and actively partner with development teams to implement</p><p>- Partner with the team on global release prioritization and schedules, performing full QA and sign off on releases</p><p>- Work cross-functionally with marketing, buying, planning, and merchandising teams</p><p>- Assist in the creation of the roadmap for new site features and functionalities</p><p>- Weekly reporting of site behavior, checkout funnel and KPI analysis with Google Analytics</p><p>- Leverage analytics and customer insights to identify, recommend, and implement site optimizations</p><p>- Stay up to date on industry trends and best practices to ensure a best in class site experience</p><p>Our ideal candidate will have or are:</p><p>- 2-3 years in a similar eCommerce role</p><p>- Basic knowledge of HTML</p><p>- Experience with Javascript is a Huge Plus</p><p>- Proficient in Excel, Word, and PowerPoint</p><p>- Strong communication and collaboration skills</p><p>- Knowledge of eCommerce platforms and best practices</p><p>- Experience with Split Tests and Analyzing the Results is a Huge Plus</p><p>- Strong analytical and organizational skills</p><p>- Able to work independently within a cross-functional team environment</p><p><br></p><p>For interested applicants, please apply by following this link:&nbsp;http://bit.ly/36QHKzy</p><p>Please note that we won't be entertaining those who send their application through applying for this job post. We will only entertain those who completed the form.</p>",
        "job_skills": "Sales and Marketing,Data Analysis,Quality Assurance,Google Analytics,HTML,JSON / XML / HTML / Javascript / JQuery",
        "salary_range_from": 25000,
        "salary_range_to": 30000,
        "company_id": 18772,
        "company_name": "eJam",
        "company_location": "Overseas",
        "company_address": "3121 Michelson Drive, Irvine, Newport Beach, California 92612",
        "company_country": "United States",
        "xp_lvl": "1 - 3 years",
        "highlighted": 0,
        "is_featured": 0,
        "refreshed_at": "2020-04-08 07:01:47",
        "is_salary_hidden": false,
        "updated_at": "2020-04-08 07:01:47",
        "expired_at": "2020-05-12 16:35:19",
        "company_logo": "https://assets.bossjob.com/companies/18772/logo/bSOsyYeU5fjvN39HsWwlv9zpodKG8yE4FNGrpwI4.png",
        "is_company_verify": false,
        "job_region": "Homebased",
        "is_saved": false
      }
    ],
    "max_score": null,
    "page": 1,
    "total_pages": 82,
    "size": 12,
    "total_num": 973,
    "sort": 1,
    "query": "system",
    "params": "query_fields=job_title%2Cjob_description%2Cjob_requirements%2Ccompany_name"
  },
  "status_code": 200
}
